app/controllers/games_controller.rb

SELECT "games".* FROM "games"
---
  def index
    @games = Game.with_attached_box_picture.all

INSERT INTO "games" ("name", "game_type", "created_at", "updated_at", "rule") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "prueba "], ["game_type", "prueba"], ["created_at", "2020-06-15 21:07:40.164723"], ["updated_at", "2020-06-15 21:07:40.164723"], ["rule", "prueba 1 blablabla\r\nprueba 2 blablabla"]]
---
  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save

UPDATE "games" SET "updated_at" = $1 WHERE "games"."id" = $2  [["updated_at", "2020-06-15 21:07:40.178056"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @game.update(game_params)

DELETE FROM "games" WHERE "games"."id" = $1  [["id", 1]]
---
  def destroy
    @game.destroy