app/controllers/games_controller.rb

INSERT INTO "games" ("name", "game_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "MyString"], ["game_type", "MyString"], ["created_at", "2020-06-16 05:50:37.562164"], ["updated_at", "2020-06-16 05:50:37.562164"]]
---
  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_game
      @game = Game.find(params[:id])